IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_cla_prom_crc32_regs.xml
<module id="CLA_PROM_CRC32_REGS" HW_revision="" description="CLA PROM CRC32 Registers">
	<register id="CRC32_CONTROLREG" width="32" page="1" offset="0x0" internal="0" description="CRC32-Control Register">
		<bitfield id="START" description="Start Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FREE_SOFT" description="emulation control bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HALT" description="Halt Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="BLOCKSIZE" description="Block size of ROM for which CRC is to be calculated" begin="22" end="16" width="7" rwaccess="RW"/>
	</register>
	<register id="CRC32_STARTADDRESS" width="32" page="1" offset="0x2" internal="0" description="CRC32-Start address register">
		<bitfield id="START_ADDRESS" description="Start address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRC32_SEED" width="32" page="1" offset="0x4" internal="0" description="CRC32-Seed Register">
		<bitfield id="SEED" description="Initial CRC value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRC32_STATUSREG" width="32" page="1" offset="0x6" internal="0" description="CRC32-Status Register">
		<bitfield id="CURRENTADDR" description="Point to the data fetch unit current address" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="CRCCHECKSTATUS" description="CRC active status" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="RUNSTATUS" description="CRC active status" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="CRC32_CRCRESULT" width="32" page="1" offset="0x8" internal="0" description="CRC32-CRC result Register">
		<bitfield id="CRCRESULT" description="CRC result register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CRC32_GOLDENCRC" width="32" page="1" offset="0xa" internal="0" description="CRC32-Golden CRC register">
		<bitfield id="GOLDENCRC" description="Golden CRC register" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRC32_INTEN" width="32" page="1" offset="0x18" internal="0" description="CRC32-Interrupt enable register">
		<bitfield id="CRCDONE" description="CRCDONE interrupt enable register" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CRC32_FLG" width="32" page="1" offset="0x1a" internal="0" description="CRC32-Interrupt Flag Register">
		<bitfield id="INT" description="Global Interrupt status flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CRCDONE" description="CRCDONE Interrupt status flag" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="CRC32_CLR" width="32" page="1" offset="0x1c" internal="0" description="CRC32-Interrupt Clear Register">
		<bitfield id="INT" description="Global Interrupt clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CRCDONE" description="CRCDONE Interrupt clear" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CRC32_FRC" width="32" page="1" offset="0x1e" internal="0" description="CRC32-Interrupt Force Register">
		<bitfield id="CRCDONE" description="CRCDONE Interrupt force" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
